/*
Navicat MySQL Data Transfer

Source Server         : 127.0.0.1
Source Server Version : 50717
Source Host           : localhost:3306
Source Database       : build

Target Server Type    : MYSQL
Target Server Version : 50717
File Encoding         : 65001

Date: 2017-11-15 17:22:19
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for house
-- ----------------------------
DROP TABLE IF EXISTS `house`;
CREATE TABLE `house` (
  `id` bigint(255) NOT NULL AUTO_INCREMENT,
  `buildName` varchar(255) DEFAULT NULL,
  `type` varchar(255) DEFAULT NULL,
  `avgPrice` double(10,2) DEFAULT NULL,
  `structure` varchar(255) DEFAULT NULL,
  `coveredArea` varchar(255) DEFAULT NULL,
  `location` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=396 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of house
-- ----------------------------
INSERT INTO `house` VALUES ('304', '万科桃源里', '住宅', '11000.00', '三室', '100-114平', '广州市增城区派谭镇');
INSERT INTO `house` VALUES ('305', '佳兆业天墅', '别墅', '-1.00', '四室', '98-318平', '广州市广州大道北同宝路8号');
INSERT INTO `house` VALUES ('306', '融创御府', '住宅', '19000.00', '三室', '89-89平', '南海区大沥镇岭南路88号');
INSERT INTO `house` VALUES ('307', '海伦春天', '住宅', '9000.00', '三室', '98-108平', '城西阿房一路东段原三印厂');
INSERT INTO `house` VALUES ('308', '雁鸣湖畔', '住宅', '12000.00', '一室', '46-46平', '江门鹤山市大雁山风景区内');
INSERT INTO `house` VALUES ('309', '胜利茶博城', '商铺', '30000.00', '一室', '100-100平', '广东省清远市新城区人民路与民安北路交汇处（美吉特装饰城旁边）');
INSERT INTO `house` VALUES ('310', '荔富湖畔', '住宅', '19000.00', '二室', '76-76平', '增城市朱村街朱村大道东88号');
INSERT INTO `house` VALUES ('311', '中惠天睿', '别墅', '27000.00', '五室', '125-185平', '广州番禺区大石石北工业路');
INSERT INTO `house` VALUES ('312', '中惠天睿', '公寓', '22000.00', '五室', '120-185平', '广州番禺区大石石北工业路');
INSERT INTO `house` VALUES ('313', '佳兆业城市广场', '住宅', '25000.00', '二室', '83-83平', '黄埔区盛凯大街6号（开创大道与黄埔东路交汇处）');
INSERT INTO `house` VALUES ('314', '叠翠峰', '住宅', '22000.00', '三室', '87-87平', '南沙区凤凰大道与丰泽西路交汇处（蕉门地铁站B出口）');
INSERT INTO `house` VALUES ('315', '绿湖国际城', '住宅', '14500.00', '三室', '84-112平', '广州市增城区石滩镇馨湖三街');
INSERT INTO `house` VALUES ('316', '合景天銮', '住宅', '25000.00', '三室', '99-134平', '佛山市北滘镇君兰社区居民委员会木华路2号天銮花园');
INSERT INTO `house` VALUES ('317', '新城市·星海墅', '别墅', '32000.00', '五室', '422-612平', '广州市番禺区坑口路123号');
INSERT INTO `house` VALUES ('318', '蔷薇国际花园(实地蔷薇国际)', '住宅', '20000.00', '三室', '138-138平', '广州广汕路实地蔷薇国际 21号线（在建）钟岗地铁站西侧');
INSERT INTO `house` VALUES ('319', '雅居蓝湾', '住宅', '7800.00', '二室', '84-138平', '佛山市高明区杨和镇杨西大道501号');
INSERT INTO `house` VALUES ('320', '合生紫龙府', '住宅', '68000.00', '四室', '145-145平', '海珠区艺洲路602号（新领事馆东侧）');
INSERT INTO `house` VALUES ('321', '汇金中心', '商铺', '32000.00', '一室', '78-78平', '广州市天河区黄埔大道中658号');
INSERT INTO `house` VALUES ('322', '万科海上传奇', '公寓', '56000.00', '一室', '27-34平', '荔湾芳村珠江隧道口以西');
INSERT INTO `house` VALUES ('323', '华发荟花园(华发荔湾荟)', '住宅', '40000.00', '二室', '75-137平', '荔湾区秀水涌以北、郭村路以南、芳信路以西地');
INSERT INTO `house` VALUES ('324', '水岸花城', '住宅', '9600.00', '三室', '124-124平', '榕城区东二路以东临江南路东片区');
INSERT INTO `house` VALUES ('325', '中惠睿元', '别墅', '65000.00', '一室', '457-457平', '广州市天河区天慧路11号');
INSERT INTO `house` VALUES ('326', '保利罗兰国际', '住宅', '39000.00', '三室', '90-125平', '广州市萝岗开创大道国际演艺中心旁');
INSERT INTO `house` VALUES ('327', '御林苑', '住宅', '9000.00', '二室', '77-77平', '清新区太和镇环城中路8号（清新花园酒店旁）');
INSERT INTO `house` VALUES ('328', '远洋天骄', '住宅', '75000.00', '一室', '223000-223000平', '天河区元岗路68号（元岗公园以西）');
INSERT INTO `house` VALUES ('329', '寰城海航广场', '办公楼', '38500.00', '一室', '95-95平', '广州市天河北路365号（天河北路与林和东路交界处）');
INSERT INTO `house` VALUES ('330', '南海万科广场', '住宅', '25000.00', '三室', '86-136平', '南海区桂城桂澜路与佛平路交汇（南桂路地铁站B出口）');
INSERT INTO `house` VALUES ('331', '实地常春藤', '住宅', '23000.00', '二室', '71-71平', '黄埔区长岭居东部禾丰小学旁');
INSERT INTO `house` VALUES ('332', '连城湾', '住宅', '17500.00', '二室', '91.54-91.54平', '佛山市大沥镇盐步街道荣阳大街22号（海傍路旁）');
INSERT INTO `house` VALUES ('333', '芙蓉墅', '住宅', '23000.00', '四室', '192-192平', '花都狮岭镇芙蓉嶂度假区西南处芙蓉墅云缦街1-14号（芙蓉嶂水库旁）');
INSERT INTO `house` VALUES ('334', '鼎旺商业中心', '商铺', '35000.00', '一室', '100-100平', '陈村镇白陈路50号');
INSERT INTO `house` VALUES ('335', '天誉半岛', '住宅', '70000.00', '四室', '205-205平', '广州市海珠区同福西路2号');
INSERT INTO `house` VALUES ('336', '宗德服务中心（中国·德国港）', '公寓', '16000.00', '一室', '90-90平', '佛山新城天虹路与百合道交汇处');
INSERT INTO `house` VALUES ('337', '中海花湾壹号', '住宅', '38000.00', '二室', '80-80平', '荔湾区 广钢新城地铁西朗站A出口');
INSERT INTO `house` VALUES ('338', '鼎旺商业中心', '公寓', '15000.00', '二室', '100-100平', '陈村镇白陈路50号');
INSERT INTO `house` VALUES ('339', '金融城-汇金东翼', '办公楼', '45000.00', '一室', '100-100平', '广州市天河区黄埔大道中658号');
INSERT INTO `house` VALUES ('340', '桂丹颐景园', '住宅', '9800.00', '二室', '79-124平', '佛山南海区桂丹西路22号（金沙大桥往前1公里）');
INSERT INTO `house` VALUES ('341', '水岸峯景', '住宅', '12800.00', '二室', '73.90-174平', '花都区新街大道望亭路15号');
INSERT INTO `house` VALUES ('342', '奥园香雪府', '住宅', '33000.00', '三室', '96.52-96.52平', '广州市萝岗区开萝大道与香雪大道交汇处');
INSERT INTO `house` VALUES ('343', '万科世博汇', '公寓', '28000.00', '二室', '95-95平', '番禺区广州南站汉溪大道和石兴大道交汇处');
INSERT INTO `house` VALUES ('344', '合景云溪四季', '住宅', '18000.00', '二室', '95-95平', '广州市增城区朱村街道朱石路旁');
INSERT INTO `house` VALUES ('345', '星汇御府', '住宅', '55000.00', '一室', '300-300平', '天河区海业路6号');
INSERT INTO `house` VALUES ('346', '万科云城米酷', '公寓', '31000.00', '一室', '25-25平', '广州市天河区明旭街1号');
INSERT INTO `house` VALUES ('347', '桂丹颐景园', '商铺', '8000.00', '一室', '100-100平', '佛山南海区桂丹西路22号（金沙大桥往前1公里）');
INSERT INTO `house` VALUES ('348', '尚东.大夫山', '住宅', '21500.00', '二室', '79-79平', '广州市番禺区东桥大街68号');
INSERT INTO `house` VALUES ('349', '保利南悦湾', '住宅', '22000.00', '二室', '66-66平', '广州市南沙区黄阁镇汽车城南部保利南悦湾');
INSERT INTO `house` VALUES ('350', '万科云城米酷', '办公楼', '27500.00', '一室', '13-37平', '广州市天河区明旭街1号');
INSERT INTO `house` VALUES ('351', '奥园观湖尚居', '住宅', '14000.00', '四室', '124-124平', '佛山南海技校学院旁');
INSERT INTO `house` VALUES ('352', '珠光花城御景花园', '公寓', '63000.00', '三室', '119-119平', '天河区花城大道768号（潭村地铁站B出口东行300米）');
INSERT INTO `house` VALUES ('353', '金融城-汇金东翼', '商铺', '45000.00', '一室', '43-100平', '广州市天河区黄埔大道中658号');
INSERT INTO `house` VALUES ('354', '万科云城米酷', '商铺', '24000.00', '一室', '25-25平', '广州市天河区明旭街1号');
INSERT INTO `house` VALUES ('355', '畔山花园', '住宅', '8000.00', '一室', '30-89平', '鹤山市共和镇共兴路（南兴村旁）');
INSERT INTO `house` VALUES ('356', '珠光花城御景花园', '住宅', '63000.00', '一室', '75-75平', '天河区花城大道768号（潭村地铁站B出口东行300米）');
INSERT INTO `house` VALUES ('357', '万科里享家', '住宅', '21500.00', '三室', '75-75平', '广州市黄埔区长岭居新业路与布岭路交汇处（甘竹山东南麓）');
INSERT INTO `house` VALUES ('358', '峻廷湾', '住宅', '6500.00', '二室', '520-520平', '鹤山市新环路旁');
INSERT INTO `house` VALUES ('359', '合生湖山国际', '住宅', '23000.00', '二室', '88-89平', '增城新塘镇源章大道（碧桂园凤凰城旁）');
INSERT INTO `house` VALUES ('360', '融创香山府', '住宅', '11000.00', '四室', '124-124平', '中山市阜沙镇阜港西路2号');
INSERT INTO `house` VALUES ('361', '保利鱼珠港', '办公楼', '40000.00', '一室', '133-133平', '广州市黄埔区黄埔大道东840号');
INSERT INTO `house` VALUES ('362', '奥园康威广场', '商铺', '6800.00', '三室', '70-70平', '增城新塘镇荔新大道和香山大道交汇处（新塘汽车客运站旁边）');
INSERT INTO `house` VALUES ('363', '御湖名邸', '住宅', '19000.00', '一室', '200-200平', '黄埔金坑水库路38号（金坑森林公园内）');
INSERT INTO `house` VALUES ('364', '绿地香榭花城', '住宅', '13500.00', '三室', '111-111平', '佛山市南海区狮山镇小塘三环东路');
INSERT INTO `house` VALUES ('365', '万科春风十里', '住宅', '23000.00', '四室', '100-100平', '广州市增城区朱村大道东72号 地铁象岭站旁');
INSERT INTO `house` VALUES ('366', '保利大都汇', '办公楼', '35000.00', '一室', '100-100平', '番禺汉溪大道与新光快速交汇处');
INSERT INTO `house` VALUES ('367', '富力天海湾', '住宅', '16000.00', '三室', '120-120平', '广州南沙区环市大道西工业一路（地铁四号线延长线塘坑地铁站旁）');
INSERT INTO `house` VALUES ('368', '御湖名邸', '别墅', '19000.00', '四室', '430-430平', '黄埔金坑水库路38号（金坑森林公园内）');
INSERT INTO `house` VALUES ('369', '保利天悦花园', '办公楼', '40000.00', '一室', '1850000-1850000平', '海珠区晖悦二街6号（琶洲塔公园东行约500米）');
INSERT INTO `house` VALUES ('370', '万科尚城', '住宅', '31000.00', '二室', '65-65平', '黄埔区黄埔东路与丹水坑路交界（南岗地铁站旁）');
INSERT INTO `house` VALUES ('371', '富力悦禧花园', '住宅', '21000.00', '二室', '86-86平', '黄埔区广园快速与开发大道交汇处');
INSERT INTO `house` VALUES ('372', '绿地国际花都', '住宅', '13000.00', '一室', '43-43平', '顺德陈村大道与佛陈路交汇处(顺联广场对面)');
INSERT INTO `house` VALUES ('373', '万科幸福誉', '住宅', '21000.00', '二室', '70-70平', '黄埔区九龙镇九龙大道（中新广州知识城展...');
INSERT INTO `house` VALUES ('374', '锦绣一方', '住宅', '19000.00', '三室', '85-145平', '广州市番禺区石楼镇建设路联围小学斜对面');
INSERT INTO `house` VALUES ('375', '同创誉城', '公寓', '-1.00', '二室', '46-90平', ' 广州市番禺区南村镇国泰路8号');
INSERT INTO `house` VALUES ('376', '合创新城', '住宅', '7000.00', '三室', '109-109平', '清新区清新区太和镇新城路中1号');
INSERT INTO `house` VALUES ('377', '中环品悦', '住宅', '8800.00', '一室', '59-100平', '清远市清新区太和镇清新路段107国道601号');
INSERT INTO `house` VALUES ('378', '路福联合广场', '办公楼', '-1.00', '一室', '100-100平', '番禺区石壁街汉溪大道西233号');
INSERT INTO `house` VALUES ('379', '万科金色里程', '住宅', '16000.00', '三室', '79-90平', '万科金色里程');
INSERT INTO `house` VALUES ('380', '万科金域中央', '住宅', '16000.00', '三室', '90-120平', '万科金域中央');
INSERT INTO `house` VALUES ('381', '广州绿地中央广场', '办公楼', '23000.00', '一室', '46-46平', '萝岗区科学大道106号（科学大道与神舟路交汇处）');
INSERT INTO `house` VALUES ('382', '万领蓝珊郡', '住宅', '-1.00', '二室', '90-117平', '中山三角镇金三大道东（新华路口）');
INSERT INTO `house` VALUES ('383', '中庄翠庭', '住宅', '-1.00', '二室', '79-119平', '中山市西区隆平路彩虹酒店背后');
INSERT INTO `house` VALUES ('384', '龙汇领峰', '住宅', '-1.00', '二室', '80-122平', '龙汇领峰');
INSERT INTO `house` VALUES ('385', '君立国际公寓', '公寓', '-1.00', '一室', '40.60-40.60平', '白云同和路318号(同和地铁站D出口北侧约800米)');
INSERT INTO `house` VALUES ('386', '万达文化旅游城', '住宅', '22000.00', '二室', '89-119平', '万达文化旅游城');
INSERT INTO `house` VALUES ('387', '汇悦台', '住宅', '120000.00', '三室', '236-317平', '天河区珠江新城临江大道417-431号');
INSERT INTO `house` VALUES ('388', '香江国际', '住宅', '5900.00', '二室', '65-82平', '岳麓区岳麓大道89号(奥克斯旁)');
INSERT INTO `house` VALUES ('389', '雅居乐富春山居', '住宅', '30000.00', '二室', '86-413平', '黄埔区广州开发区悦然四街6号（大观北路与广汕路交界处）');
INSERT INTO `house` VALUES ('390', '天盈广场', '办公楼', '53000.00', '一室', '340-340平', '广州市天河区兴民路222号');
INSERT INTO `house` VALUES ('391', '富力东山新天地', '住宅', '37000.00', '五室', '307-307平', '广州市越秀区新天地街1、3、5、7、9号（广州大道与中山一路交汇处）');
INSERT INTO `house` VALUES ('392', '锦林山庄', '住宅', '60000.00', '二室', '92-136平', '黄埔荔芳一街');
INSERT INTO `house` VALUES ('393', '中铁诺德中心', '办公楼', '30000.00', '一室', '66-66平', '番禺区南村镇汉溪大道东471号');
INSERT INTO `house` VALUES ('394', '琶洲壹号', '住宅', '55000.00', '五室', '526-1024平', '海珠新港东路2348号（万胜围地铁站沿新港东路往东300米）');
INSERT INTO `house` VALUES ('395', '汇金中心', '办公楼', '32000.00', '一室', '140-140平', '广州市天河区黄埔大道中658号');
